journal.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-13 Mon 13:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="scurfman" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7f1a6bb">1. 2024</a>
<ul>
<li><a href="#orgb4c42b6">1.1. 2024-01 January</a>
<ul>
<li><a href="#org3b4753a">1.1.1. 2024-01-17 Wednesday</a></li>
<li><a href="#org41f5b21">1.1.2. 2024-01-18 Thursday</a></li>
<li><a href="#orgfc7ca68">1.1.3. 2024-01-19 Friday</a></li>
<li><a href="#org1bd0a9e">1.1.4. 2024-01-22 Monday</a></li>
</ul>
</li>
<li><a href="#org89f419c">1.2. 2024-05 May</a>
<ul>
<li><a href="#org9c21974">1.2.1. 2024-05-13 Monday</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org7f1a6bb" class="outline-2">
<h2 id="org7f1a6bb"><span class="section-number-2">1.</span> 2024</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgb4c42b6" class="outline-3">
<h3 id="orgb4c42b6"><span class="section-number-3">1.1.</span> 2024-01 January</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org3b4753a" class="outline-4">
<h4 id="org3b4753a"><span class="section-number-4">1.1.1.</span> 2024-01-17 Wednesday</h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
<ol class="org-ol">
<li><a id="org54d6fb1"></a>Onboarding Notes 'OpenSYDE Plugins (J1939)'<br />
<ol class="org-ol">
<li><a id="org52be0be"></a>Added to project <span class="timestamp-wrapper"><span class="timestamp">[2024-01-17 Wed 13:20]</span></span><br />
<ol class="org-ol">
<li><a id="org050fe7d"></a><span class="done DONE">DONE</span> Next Actions <code>[8/8]</code> <span class="timestamp-wrapper"><span class="timestamp">&lt;2024-01-17 Wed 17:35&gt;</span></span><br />
<div class="outline-text-7" id="text-1-1-1-1-1-1">
<ul class="org-ul">
<li class="on"><code>[X]</code> Refer to the How-to prepared by TG</li>
<li class="on"><code>[X]</code> Download and install "i686-8.1.0-release-posix-dwarf-rt<sub>v6</sub>-rev0.7z"</li>
<li class="on"><code>[X]</code> Download and install "openSYDE<sub>Release</sub> 22-0B(v1.42r0).zip"</li>
<li class="on"><code>[X]</code> Download and install "qt-creator-opensource-windows-x86<sub>64</sub>-4.14.2.exe"</li>
<li class="on"><code>[X]</code> Download and install "qt-unified-windows-x86-4.3.0-1-online.exe"</li>
<li class="on"><code>[X]</code> Setup user account with QT</li>
<li class="on"><code>[X]</code> clone github repo <a href="https://github.com/STW-Technic-LP/J1939Plugin">https://github.com/STW-Technic-LP/J1939Plugin</a></li>
<li class="on"><code>[X]</code> start a documentaion journal for onboarding process.</li>
</ul>
<p>
Entered on <span class="timestamp-wrapper"><span class="timestamp">[2024-01-17 Wed 15:18]</span></span>
</p>
</div>
</li>
</ol>
</li>
</ol>
</li>
<li><a id="orga36ca4a"></a>Toolchain setup<br />
<div class="outline-text-5" id="text-1-1-1-2">
<ul class="org-ul">
<li>Minor confustion on version.  Text of pdf says 15.5.2, URL in pdf goes to 14.4.2 (newer than 15.5.2?)</li>
<li>TG confirmed target version is 15.5.2.  Used web installer to choose 'custom install' and selected 15.5.2</li>
<li>Took a couple trie to get install correct. <span class="timestamp-wrapper"><span class="timestamp">[2024-01-17 Wed 16:29]</span></span></li>
<li>QT Creator installed, Mingw 8.1 configured, J1939 github project cloned</li>
<li>Left off at <span class="timestamp-wrapper"><span class="timestamp">[2024-01-17 Wed 17:35] </span></span> with J1939 github project opened inside of QT Creator.  Contact TG for next step.</li>
</ul>
<p>
Entered on <span class="timestamp-wrapper"><span class="timestamp">[2024-01-17 Wed 15:31]</span></span>
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org41f5b21" class="outline-4">
<h4 id="org41f5b21"><span class="section-number-4">1.1.2.</span> 2024-01-18 Thursday</h4>
<div class="outline-text-4" id="text-1-1-2">
</div>
<ol class="org-ol">
<li><a id="org90a8dac"></a>Toolchain setup continued<br />
<ol class="org-ol">
<li><a id="orgc094e1c"></a><span class="done DONE">DONE</span> Next Actions <code>[2/2]</code><br />
<div class="outline-text-6" id="text-1-1-2-1-1">
<ul class="org-ul">
<li class="on"><code>[X]</code> Import, Open, and Build openSYDE using Qt Creator
<ul class="org-ul">
<li>FAILED: 1st attempt would not build, Qt stopped build process, error indicated missing files</li>
<li>FAILED: Per TG, turned off 'Shadow Build' still failed.</li>
<li>PASSED: Possible 260 char limit of path / filenames issue.  Moved project up higher in C:/. Build OK</li>
<li>NOTE: created Qt projects directory under <code>C:\stw\qtProjects</code> to minimize char length and eliminate spaces in directory name.
prior folder was in a OneDrive managed user folder. <code>C:\Users\silas.curfman\OneDrive - STW Technic LP\Documents\_PROJECTS&gt;</code></li>
</ul></li>
<li class="on"><code>[X]</code> Run freshly built openSYDE project.
<ul class="org-ul">
<li>PASSED/FAILED: Application correctly launched an instance of openSYDE but upon viewing About, version was 1.6.0.
We needed v1.42.0r.  TG set out to get new files.</li>
<li>PASSED: New .zip project imported, built, and ran successfully</li>
</ul></li>
</ul>
<p>
Entered on <span class="timestamp-wrapper"><span class="timestamp">[2024-01-18 Thu 15:28]</span></span>
</p>
</div>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-orgfc7ca68" class="outline-4">
<h4 id="orgfc7ca68"><span class="section-number-4">1.1.3.</span> 2024-01-19 Friday</h4>
<div class="outline-text-4" id="text-1-1-3">
</div>
<ol class="org-ol">
<li><a id="org781c870"></a>Plug-in Project Review<br />
<div class="outline-text-5" id="text-1-1-3-1">
<ul class="org-ul">
<li>With current .pro correctly running in Qt Creator, take time to explore both Qt and the code base.</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org35aa932"></a><span class="done DONE">DONE</span> Next Actions <code>[4/4]</code><br />
<div class="outline-text-6" id="text-1-1-3-1-1">
<ul class="org-ul">
<li class="on"><code>[X]</code> Complete Qt built in new user tour</li>
<li class="on"><code>[X]</code> Explore the file / folder structure of the project</li>
<li class="on"><code>[X]</code> Run the compiled binary, explore the version of openSYDE it launches</li>
<li class="on"><code>[X]</code> To see the plugin, need to import in some devices, copy over from your production copy of openSYDE.</li>
</ul>
</div>
</li>
<li><a id="orgccb07cf"></a><span class="done DONE">DONE</span> Topic / Reference Review <code>[7/7]</code><br />
<div class="outline-text-6" id="text-1-1-3-1-2">
<ul class="org-ul">
<li class="on"><code>[X]</code> J1939 DBC</li>
<li class="on"><code>[X]</code> J1939 PGN</li>
<li class="on"><code>[X]</code> J1939 SPN</li>
<li class="on"><code>[X]</code> dbc<sub>driver</sub><sub>library</sub> on openSYDE github project.</li>
<li class="on"><code>[X]</code> visit Vector Informatik, DBC related info</li>
<li class="on"><code>[X]</code> where is UI info for J1939 plugin defined?  <span class="timestamp-wrapper"><span class="timestamp">[2024-01-19 Fri 17:46] </span></span></li>
<li class="on"><code>[X]</code> revisit C<sub>Sd</sub><sub>BueComlfDescriptionWidget</sub> in Qt, "page" or tab 5/5 is J1939 UI. <span class="timestamp-wrapper"><span class="timestamp">[2024-01-19 Fri 17:52] </span></span></li>
</ul>
<p>
Entered on <span class="timestamp-wrapper"><span class="timestamp">[2024-01-19 Fri 09:06]</span></span>
</p>
</div>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org1bd0a9e" class="outline-4">
<h4 id="org1bd0a9e"><span class="section-number-4">1.1.4.</span> 2024-01-22 Monday</h4>
<div class="outline-text-4" id="text-1-1-4">
</div>
<ol class="org-ol">
<li><a id="org29fd337"></a>Qt Creator 12 onboarding<br />
<div class="outline-text-5" id="text-1-1-4-1">
<p>
Entered on <span class="timestamp-wrapper"><span class="timestamp">[2024-01-22 Mon 07:30]</span></span>
</p>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-org89f419c" class="outline-3">
<h3 id="org89f419c"><span class="section-number-3">1.2.</span> 2024-05 May</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org9c21974" class="outline-4">
<h4 id="org9c21974"><span class="section-number-4">1.2.1.</span> 2024-05-13 Monday</h4>
<div class="outline-text-4" id="text-1-2-1">
</div>
<ol class="org-ol">
<li><a id="orgdaa2f3c"></a>Weekly Planning<br />
<ol class="org-ol">
<li><a id="org1c12acc"></a><span class="todo TODO">TODO</span> New Flyer <code>[0/3]</code><br />
<div class="outline-text-6" id="text-1-2-1-1-1">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Jira review</li>
<li class="off"><code>[&#xa0;]</code> Meet with KB, monday</li>
<li class="off"><code>[&#xa0;]</code> Meet with JG, tuesday</li>
</ul>
</div>
</li>
<li><a id="orgd94b61e"></a><span class="todo TODO">TODO</span> GCP+Verifi <code>[/]</code><br />
<div class="outline-text-6" id="text-1-2-1-1-2">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Jira review</li>
</ul>
</div>
</li>
<li><a id="orga04b7cf"></a><span class="todo TODO">TODO</span> Distek ISOBUS <code>[0/2]</code><br />
<div class="outline-text-6" id="text-1-2-1-1-3">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Jira review</li>
<li class="off"><code>[&#xa0;]</code> Check for tracking number, display from JG</li>
</ul>
</div>
</li>
<li><a id="org4d9a979"></a><span class="todo TODO">TODO</span> J1939 Plugin <code>[0/2]</code><br />
<div class="outline-text-6" id="text-1-2-1-1-4">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Jira review</li>
<li class="off"><code>[&#xa0;]</code> Meeting with TG, monday</li>
</ul>
</div>
</li>
<li><a id="org55d462a"></a><span class="todo TODO">TODO</span> Misc <code>[0/2]</code><br />
<div class="outline-text-6" id="text-1-2-1-1-5">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Meet with AR, paycor Wednesday</li>
<li class="off"><code>[&#xa0;]</code> Home Office Maint
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> misc tooling</li>
<li class="off"><code>[&#xa0;]</code> install more shelf space</li>
<li class="off"><code>[&#xa0;]</code> replace router / wifi</li>
<li class="off"><code>[&#xa0;]</code> segment network</li>
<li class="off"><code>[&#xa0;]</code> janitorial (vacuum, etc)</li>
</ul></li>
</ul>
<p>
Entered on <span class="timestamp-wrapper"><span class="timestamp">[2024-05-13 Mon 07:30]</span></span>
</p>
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: scurfman</p>
<p class="date">Created: 2024-05-13 Mon 13:31</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>